app/views/teams/_form.html.erb

SELECT "leagues".* FROM "leagues"
---
		<%= f.label :league_id %>
		<%= f.select :league_id, League.all.collect { |league| [ league.name, league.id ] } %>