app/views/teams/show.html.erb

SELECT "players".* FROM "players" WHERE "players"."team_id" = 1
---
	<ul>
		<% @team.players.each do |player| %>