app/views/leagues/show.html.erb

<ul>
	<% @league.teams.each do |team| %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."league_id" = 1