app/controllers/leagues_controller.rb

SELECT "leagues".* FROM "leagues"
---
	def index
		@leagues = League.all

INSERT INTO "leagues" ("country", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["country", "England"], ["created_at", Tue, 24 Sep 2013 01:05:08 UTC +00:00], ["name", "Barclays Premier League"], ["updated_at", Tue, 24 Sep 2013 01:05:08 UTC +00:00]]
---
	def create
		League.create(params[:league])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def show
		@league = League.find(params[:id])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def edit
		@league = League.find(params[:id])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "leagues" SET "name" = 'Barclays Premier Leagueeee', "country" = 'dddd', "updated_at" = '2013-09-24 01:13:40.096789' WHERE "leagues"."id" = 1
---
	def update
		league = League.find(params[:id])
		league.update_attributes(params[:league])