app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
	def index
		@players = Player.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "players" ("age", "created_at", "name", "nationality", "position", "team_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		team = Team.find(params[:team_id])
		player = Player.new(params[:player])
		team.players << player

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def show
		@player = Player.find(params[:id])