app/controllers/teams_controller.rb

	def index
		@teams = Team.all
---
SELECT "teams".* FROM "teams"

	def create
		Team.create(params[:team])
---
INSERT INTO "teams" ("city", "created_at", "league_id", "name", "place_last_year", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["city", "London"], ["created_at", Tue, 24 Sep 2013 01:34:40 UTC +00:00], ["league_id", 1], ["name", "Chelsea FC"], ["place_last_year", 3], ["updated_at", Tue, 24 Sep 2013 01:34:40 UTC +00:00]]

	def show
		@team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]

	def edit
		@team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]

	def update
		team = Team.find(params[:id])
		team.update_attributes(params[:team])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "teams" SET "name" = 'Chelsea FCCC', "city" = 'nnnn', "place_last_year" = 7, "updated_at" = '2013-09-24 01:34:46.965709' WHERE "teams"."id" = 1